obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
void return_home_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    // del_screen_login_windows();
    show_screen_main_screen();
}

void unlock_setting_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    // del_screen_login_windows();
    show_screen_config_screen();
}

void home_button_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    show_screen_main_screen();
}

void calib_button_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    show_screen_calib_screen();
}

void calib_to_home_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    show_screen_main_screen();
}

char buff_calib_text[15];
uint32_t raw_adc_ph, adc_avg;
float calib_val, calib_val_a, calib_val_b, calib_val_c;
uint8_t point;

void enable_calib_adc(uint8_t set_point)
{
    point = set_point;
}

static int i;

void calib_pH(uint8_t set_point)
{
    point = 0;
    switch (set_point)
    {
        case 1:
            lv_label_set_text(pH_pos_a, "watting..");
            break;   
        case 2:
            lv_label_set_text(pH_pos_b, "watting..");
            break;
        case 3:
            lv_label_set_text(pH_pos_c, "watting..");
            break;    
    }
    vTaskDelay(pdMS_TO_TICKS(100));
    memset(buff_calib_text, 0, 15);
    adc1_config_channel_atten((adc1_channel_t)ADC_CHANNEL_4, ADC_ATTEN_DB_2_5);
    for(i=0; i < 100; i++)
    {
        raw_adc_ph   = adc1_get_raw((adc1_channel_t)ADC_CHANNEL_4);
        adc_avg += raw_adc_ph;
        printf("count: %d calib : %d\r\n", i, raw_adc_ph);
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    calib_val = (float)adc_avg/(float)1000;
    sprintf(buff_calib_text,"%d", (uint32_t)calib_val);
    printf("calib val: %f text:%s\r\n", calib_val, buff_calib_text);
    switch (set_point)
    {
        case 1:
            calib_val_a = calib_val;
            lv_label_set_text(pH_pos_a, buff_calib_text);
            break;   
        case 2:
            calib_val_b = calib_val;
            lv_label_set_text(pH_pos_b, buff_calib_text);
            break;
        case 3:
            calib_val_c = calib_val;
            lv_label_set_text(pH_pos_c, buff_calib_text);
            break;    
    }

}

void start_calib_a_event_handler(lv_obj_t *event_kb, lv_event_t event)
{

    lv_label_set_text(pH_pos_a, "watting..");
    for(int i=0; i<1000; i++)
    {
        raw_adc_ph   = adc1_get_raw((adc1_channel_t)ADC_CHANNEL_4);
        adc_avg += raw_adc_ph;
        printf("count: %d calib 4.01: %d\r\n", i, raw_adc_ph);
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    calib_val_a = (float)adc_avg/(float)1000;
    sprintf(buff_calib_text,"%d", (uint32_t)calib_val_a);
    lv_label_set_text(pH_pos_a, buff_calib_text);
    memset(buff_calib_text, 0, 15);
    
}

void start_calib_b_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    lv_label_set_text(pH_pos_b, "watting..");
    for(int i=0; i<1000; i++)
    {
        raw_adc_ph   = adc1_get_raw((adc1_channel_t)ADC_CHANNEL_4);
        adc_avg += raw_adc_ph;
        printf("count: %d calib 6.86: %d\r\n", i, raw_adc_ph);
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    calib_val_b = (float)adc_avg/(float)1000;
    sprintf(buff_calib_text,"%d", (uint32_t)calib_val_b);
    lv_label_set_text(pH_pos_b, buff_calib_text);
    memset(buff_calib_text, 0, 15);
}

void start_calib_c_event_handler(lv_obj_t *event_kb, lv_event_t event)
{
    lv_label_set_text(pH_pos_c, "watting..");
    for(int i=0; i<1000; i++)
    {
        raw_adc_ph   = adc1_get_raw((adc1_channel_t)ADC_CHANNEL_4);
        adc_avg += raw_adc_ph;
        printf("count: %d calib 9.18: %d\r\n", i, raw_adc_ph);
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    calib_val_a = (float)adc_avg/(float)1000;
    sprintf(buff_calib_text,"%d", (uint32_t)calib_val_c);
    lv_label_set_text(pH_pos_c, buff_calib_text);
    memset(buff_calib_text, 0, 15);
}


////////////////////////////////////////

static void g_kb_event_cb(lv_obj_t *event_kb, lv_event_t event)
{
    /* Just call the regular event handler */
    if(event == LV_EVENT_APPLY)
    {
        lv_obj_set_hidden(event_kb, true);
    }
    else if(event == LV_EVENT_CANCEL)
    {
        lv_obj_set_hidden(event_kb, true);
    }
    else
    {
        lv_keyboard_def_event_cb(event_kb, event);
    }
}
static void g_create_kb_ifneeded()
{
    if(g_kb == NULL)
    {
        g_kb = lv_keyboard_create(main_screen, NULL);
        lv_obj_set_pos(g_kb, 5, 90);
        lv_obj_set_event_cb(g_kb, g_kb_event_cb); /* Setting a custom event handler stops the keyboard from closing automatically */
        lv_obj_set_size(g_kb,  LV_HOR_RES - 10, 140);
        lv_keyboard_set_cursor_manage(g_kb, true); /* Automatically show/hide cursors on text areas */
        lv_obj_set_hidden(g_kb, true);
    }
}
static void g_show_kb()
{
    g_create_kb_ifneeded();
    lv_obj_set_parent(g_kb, lv_scr_act());
    lv_obj_set_hidden(g_kb, false);
    lv_obj_align(g_kb, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0);
}

/**
*开机启动屏相关
*/
static lv_style_t style_star, style_black, style_url;
LV_IMG_DECLARE(img_8ms_png);
LV_IMG_DECLARE(img_star);
lv_obj_t *logo;
lv_obj_t *logo_star;
lv_obj_t *url_label;
lv_obj_t *url_mask;
lv_obj_t *mask_layer;
int timer_cnt = 0;
/****
* 临时变量用于数据传输
*/
char _tmpbuf[32];




/*
* declear codes
*/



#ifndef LV_8MS_PRESET_UART_QUEUE
void lv_8ms_uart_queue_ana(uint8_t *data, int size)
{
    printf("ana:%s\n", wtctrl_json_parse((char *)data));
}
#endif
#ifndef CUSTOM_MQTT_PARSE
void lv_8ms_mqtt_received(const char *data)
{
    printf("custom:%s\n", data);
}
#endif
/*
 * callback functions begins
 */
/*
 * callback functions ends
 */
/*
* init codes
*/
void init_function()
{
#ifdef BLOCKLY_init
    blockly_init();
#endif
}

void lv_8ms_label_pH_create()
{
    label_pH = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(label_pH, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(label_pH, 360, 89);
    //set label style
    lv_obj_set_style_local_border_color(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_text_color(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xf3, 0x0a, 0x0e));
    lv_obj_set_style_local_text_font(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_100);

