obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
    lv_label_set_text(label_pH, "10.69");
    lv_label_set_align(label_pH, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_label_pH_EVENT_HANDLER
    lv_obj_set_event_cb(label_pH, label_pH_event_handler);
#endif
    if(label_pH->coords.x2 - label_pH->coords.x1 < 360)
    {
        int x_offset = (360 - (label_pH->coords.x2 - label_pH->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(label_pH->coords.y2 - label_pH->coords.y1 < 89)
    {
        int y_offset = (89 - (label_pH->coords.y2 - label_pH->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(label_pH, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(label_pH, 53, 48);

}
void lv_8ms_setting_button_create()
{
    setting_button = lv_img_create(main_screen, NULL);
    lv_img_set_src(setting_button, &img1627285477548_png);
    lv_obj_set_pos(setting_button, 402, 222);
    lv_obj_set_click(setting_button, true);
    lv_obj_set_style_local_image_recolor(setting_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(setting_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_setting_button_EVENT_HANDLER
    lv_obj_set_event_cb(setting_button, setting_button_event_handler);
    // #endif
}
void lv_8ms_water_dis_create()
{
    water_dis = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(water_dis, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(water_dis, 261, 53);
    //set label style
    lv_obj_set_style_local_text_color(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x7e, 0xd3, 0x21));
    lv_obj_set_style_local_text_font(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_20);

    lv_label_set_text(water_dis, "Lít H2O Hydrogen đã dùng");
    lv_label_set_align(water_dis, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_water_dis_EVENT_HANDLER
    lv_obj_set_event_cb(water_dis, water_dis_event_handler);
#endif
    if(water_dis->coords.x2 - water_dis->coords.x1 < 261)
    {
        int x_offset = (261 - (water_dis->coords.x2 - water_dis->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(water_dis->coords.y2 - water_dis->coords.y1 < 53)
    {
        int y_offset = (53 - (water_dis->coords.y2 - water_dis->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(water_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(water_dis, 205, 159);

}
void lv_8ms_label_flow_water_create()
{
    label_flow_water = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(label_flow_water, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(label_flow_water, 178, 54);
    //set label style
    lv_obj_set_style_local_radius(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 12);
    lv_obj_set_style_local_border_color(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_text_color(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x7e, 0xd3, 0x21));
    lv_obj_set_style_local_text_font(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_31);

    lv_label_set_text(label_flow_water, "123124");
    lv_label_set_align(label_flow_water, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_label_flow_water_EVENT_HANDLER
    lv_obj_set_event_cb(label_flow_water, label_flow_water_event_handler);
#endif
    if(label_flow_water->coords.x2 - label_flow_water->coords.x1 < 178)
    {
        int x_offset = (178 - (label_flow_water->coords.x2 - label_flow_water->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(label_flow_water->coords.y2 - label_flow_water->coords.y1 < 54)
    {
        int y_offset = (54 - (label_flow_water->coords.y2 - label_flow_water->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(label_flow_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(label_flow_water, 20, 158);

}
void lv_8ms_pH_dis_create()
{
    pH_dis = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(pH_dis, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(pH_dis, 65, 46);
    //set label style
    lv_obj_set_style_local_text_color(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xf3, 0x0a, 0x0e));
    lv_obj_set_style_local_text_font(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_38);

    lv_label_set_text(pH_dis, "pH");
    lv_label_set_align(pH_dis, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_pH_dis_EVENT_HANDLER
    lv_obj_set_event_cb(pH_dis, pH_dis_event_handler);
#endif
    if(pH_dis->coords.x2 - pH_dis->coords.x1 < 65)
    {
        int x_offset = (65 - (pH_dis->coords.x2 - pH_dis->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(pH_dis->coords.y2 - pH_dis->coords.y1 < 46)
    {
        int y_offset = (46 - (pH_dis->coords.y2 - pH_dis->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(pH_dis, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(pH_dis, 355, 21);

