obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
}
void lv_8ms_bar_hydrogen_create()
{
    bar_hydrogen = lv_bar_create(main_screen, NULL);
    lv_obj_set_size(bar_hydrogen, 348, 40);
    lv_obj_set_pos(bar_hydrogen, 30, 234);
    lv_bar_set_anim_time(bar_hydrogen, 1000);
    lv_bar_set_value(bar_hydrogen, 48, LV_ANIM_ON);

    /*Create a bar, an indicator and a knob style*/
    //set main part style
    lv_obj_set_style_local_bg_color(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xff, 0xff, 0xff));
    lv_obj_set_style_local_bg_grad_color(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xff, 0xff, 0xff));
    lv_obj_set_style_local_pad_top(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_bottom(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_left(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_right(bar_hydrogen, LV_BAR_PART_BG, LV_STATE_DEFAULT, 0);
    //set indic style
    lv_obj_set_style_local_bg_color(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_bg_grad_color(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_radius(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, LV_RADIUS_CIRCLE);
    lv_obj_set_style_local_pad_top(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_bottom(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_left(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, 0);
    lv_obj_set_style_local_pad_right(bar_hydrogen, LV_BAR_PART_INDIC, LV_STATE_DEFAULT, 0);
}
void lv_8ms_text_setting_create()
{
    text_setting = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(text_setting, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(text_setting, 92, 21);
    //set label style
    lv_obj_set_style_local_text_color(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xdd, 0xdf, 0xc1));
    lv_obj_set_style_local_text_font(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_20);

    lv_label_set_text(text_setting, "Setting");
    lv_label_set_align(text_setting, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_text_setting_EVENT_HANDLER
    lv_obj_set_event_cb(text_setting, text_setting_event_handler);
#endif
    if(text_setting->coords.x2 - text_setting->coords.x1 < 92)
    {
        int x_offset = (92 - (text_setting->coords.x2 - text_setting->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(text_setting->coords.y2 - text_setting->coords.y1 < 21)
    {
        int y_offset = (21 - (text_setting->coords.y2 - text_setting->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(text_setting, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(text_setting, 388, 286);

}
void lv_8ms_text_hydro_create()
{
    text_hydro = lv_label_create(main_screen, NULL);
    lv_label_set_long_mode(text_hydro, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(text_hydro, 156, 40);
    //set label style
    lv_obj_set_style_local_text_color(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_text_font(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_30);

    lv_label_set_text(text_hydro, "Hydrogen");
    lv_label_set_align(text_hydro, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_text_hydro_EVENT_HANDLER
    lv_obj_set_event_cb(text_hydro, text_hydro_event_handler);
#endif
    if(text_hydro->coords.x2 - text_hydro->coords.x1 < 156)
    {
        int x_offset = (156 - (text_hydro->coords.x2 - text_hydro->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(text_hydro->coords.y2 - text_hydro->coords.y1 < 40)
    {
        int y_offset = (40 - (text_hydro->coords.y2 - text_hydro->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(text_hydro, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(text_hydro, 136, 274);

}
void lv_8ms_home_button_create()
{
    home_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(home_button, &img1627285431674_png);
    lv_obj_set_pos(home_button, 211, 243);
    lv_obj_set_click(home_button, true);
    lv_obj_set_style_local_image_recolor(home_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(home_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_home_button_EVENT_HANDLER
    lv_obj_set_event_cb(home_button, home_button_event_handler);
    // #endif
}
void lv_8ms_calib_button_create()
{
    calib_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(calib_button, &img1629631072036_png);
    lv_obj_set_pos(calib_button, 119, 243);
    lv_obj_set_click(calib_button, true);
    lv_obj_set_style_local_image_recolor(calib_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(calib_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_calib_button_EVENT_HANDLER
    lv_obj_set_event_cb(calib_button, calib_button_event_handler);
    // #endif
}
void lv_8ms_wifi_button_create()
{
    wifi_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(wifi_button, &img1627285685903_png);
    lv_obj_set_pos(wifi_button, 303, 243);
    lv_obj_set_click(wifi_button, true);
    lv_obj_set_style_local_image_recolor(wifi_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(wifi_button, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
#ifdef BLOCKLY_wifi_button_EVENT_HANDLER
    lv_obj_set_event_cb(wifi_button, wifi_button_event_handler);
#endif
}
void lv_8ms_dropdown_select_filter_create()
{
    dropdown_select_filter = lv_dropdown_create(config_screen, NULL);
    lv_obj_set_size(dropdown_select_filter, 123, 86);
    lv_obj_set_pos(dropdown_select_filter, 8, 11);
    lv_dropdown_set_options(dropdown_select_filter,
                            "Filter 1""\n"
                            "Filter 2""\n"
                            "Filter 3""\n"
                            "Filter 4""\n"
                            "Filter 5""\n"
                            "Filter 6""\n"
                            "Filter 7""\n"
                            "Filter 8""\n"
                            ""
                           );
    lv_dropdown_set_draw_arrow(dropdown_select_filter, true);
#ifdef BLOCKLY_dropdown_select_filter_EVENT_HANDLER
    lv_obj_set_event_cb(dropdown_select_filter, dropdown_select_filter_event_handler);
#endif
    /*
    设置字体大小颜色
    */
    lv_obj_set_style_local_text_color(dropdown_select_filter, LV_DROPDOWN_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x15, 0x7a, 0xe9));
    lv_obj_set_style_local_text_color(dropdown_select_filter, LV_DROPDOWN_PART_LIST, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x15, 0x7a, 0xe9));
    /*
    设置字体大小颜色结束
    */
}
void lv_8ms_clear_button_create()
{
    clear_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(clear_button, &img1627300475973_png);
    lv_obj_set_pos(clear_button, 399, 20);
#ifdef BLOCKLY_clear_button_EVENT_HANDLER
    lv_obj_set_event_cb(clear_button, clear_button_event_handler);
#endif
}
void lv_8ms_edit_button_create()
{
    edit_button = lv_img_create(config_screen, NULL);
    lv_img_set_src(edit_button, &img1627300495627_png);
    lv_obj_set_pos(edit_button, 399, 125);
#ifdef BLOCKLY_edit_button_EVENT_HANDLER
    lv_obj_set_event_cb(edit_button, edit_button_event_handler);
#endif
}
void lv_8ms_text_info_filter_water_create()
{
    text_info_filter_water = lv_label_create(config_screen, NULL);
    lv_label_set_long_mode(text_info_filter_water, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(text_info_filter_water, 227, 215);
    //set label style
    lv_obj_set_style_local_radius(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 10);
    lv_obj_set_style_local_border_color(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_border_width(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 2);
    lv_obj_set_style_local_text_color(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x4a, 0x90, 0xe2));
    lv_obj_set_style_local_text_font(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_20);

