obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
    lv_label_set_text(text_info_filter_water, "Thông tin lõi 1");
    lv_label_set_align(text_info_filter_water, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_text_info_filter_water_EVENT_HANDLER
    lv_obj_set_event_cb(text_info_filter_water, text_info_filter_water_event_handler);
#endif
    if(text_info_filter_water->coords.x2 - text_info_filter_water->coords.x1 < 227)
    {
        int x_offset = (227 - (text_info_filter_water->coords.x2 - text_info_filter_water->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(text_info_filter_water->coords.y2 - text_info_filter_water->coords.y1 < 215)
    {
        int y_offset = (215 - (text_info_filter_water->coords.y2 - text_info_filter_water->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(text_info_filter_water, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(text_info_filter_water, 140, 12);

}
void lv_8ms_image_background_login_create()
{
    image_background_login = lv_img_create(login_screen, NULL);
    lv_img_set_src(image_background_login, &img1627285614032_png);
    lv_obj_set_pos(image_background_login, 0, 0);
#ifdef BLOCKLY_image_background_login_EVENT_HANDLER
    lv_obj_set_event_cb(image_background_login, image_background_login_event_handler);
#endif
}
void lv_8ms_seeding_display_create()
{
    seeding_display = lv_label_create(login_screen, NULL);
    lv_label_set_long_mode(seeding_display, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(seeding_display, 245, 40);
    //set label style
    lv_obj_set_style_local_radius(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 12);
    lv_obj_set_style_local_border_width(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, 1);
    lv_obj_set_style_local_text_color(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x90, 0x13, 0xfe));
    lv_obj_set_style_local_text_font(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_21);

    lv_label_set_text(seeding_display, "12E32A3CF5A1");
    lv_label_set_align(seeding_display, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_seeding_display_EVENT_HANDLER
    lv_obj_set_event_cb(seeding_display, seeding_display_event_handler);
#endif
    if(seeding_display->coords.x2 - seeding_display->coords.x1 < 245)
    {
        int x_offset = (245 - (seeding_display->coords.x2 - seeding_display->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(seeding_display->coords.y2 - seeding_display->coords.y1 < 40)
    {
        int y_offset = (40 - (seeding_display->coords.y2 - seeding_display->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(seeding_display, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(seeding_display, 114, 18);

}
void lv_8ms_return_home_create()
{
    return_home = lv_img_create(login_screen, NULL);
    lv_img_set_src(return_home, &img1627313782026_png);
    lv_obj_set_pos(return_home, 123, 216);
    lv_obj_set_click(return_home, true);
    lv_obj_set_style_local_image_recolor(return_home, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(return_home, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_return_home_EVENT_HANDLER
    lv_obj_set_event_cb(return_home, return_home_event_handler);
    // #endif
}
void lv_8ms_unlock_setting_create()
{
    unlock_setting = lv_img_create(login_screen, NULL);
    lv_img_set_src(unlock_setting, &img1627313837606_png);
    lv_obj_set_pos(unlock_setting, 295, 216);
    lv_obj_set_click(unlock_setting, true);
    lv_obj_set_style_local_image_recolor(unlock_setting, LV_IMG_PART_MAIN, LV_STATE_PRESSED, LV_COLOR_BLACK);
    lv_obj_set_style_local_image_recolor_opa(unlock_setting, LV_IMG_PART_MAIN, LV_STATE_PRESSED, 60);
    // #ifdef BLOCKLY_unlock_setting_EVENT_HANDLER
    lv_obj_set_event_cb(unlock_setting, unlock_setting_event_handler);
    // #endif
}
void lv_8ms_status_password_create()
{
    status_password = lv_label_create(login_screen, NULL);
    lv_label_set_long_mode(status_password, LV_LABEL_LONG_BREAK);
    lv_obj_set_size(status_password, 354, 40);
    //set label style
    lv_obj_set_style_local_text_color(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xe6, 0x0f, 0x0f));
    lv_obj_set_style_local_text_font(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &ali_font_26);

    lv_label_set_text(status_password, "enter password");
    lv_label_set_align(status_password, LV_LABEL_ALIGN_CENTER);
#ifdef BLOCKLY_status_password_EVENT_HANDLER
    lv_obj_set_event_cb(status_password, status_password_event_handler);
#endif
    if(status_password->coords.x2 - status_password->coords.x1 < 354)
    {
        int x_offset = (354 - (status_password->coords.x2 - status_password->coords.x1)) / 2;
        lv_obj_set_style_local_pad_left(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
        lv_obj_set_style_local_pad_right(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, x_offset);
    }
    if(status_password->coords.y2 - status_password->coords.y1 < 40)
    {
        int y_offset = (40 - (status_password->coords.y2 - status_password->coords.y1)) / 2;
        lv_obj_set_style_local_pad_bottom(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
        lv_obj_set_style_local_pad_top(status_password, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, y_offset);
    }
    lv_obj_set_pos(status_password, 63, 78);

