obitvn/8ms-esp32-pH-water/main/qm_ui_entry.c
}
void show_screen_config_screen()
{
    lv_scr_load(config_screen);
    //生成动态页面的style

}
void show_screen_login_screen()
{
    lv_scr_load(login_screen);
    //生成动态页面的style

}
void show_screen_calib_screen()
{
    lv_scr_load(calib_screen);
    //生成动态页面的style

}

extern float pH_value;
char ph_buf[10];
int screen_loop_enter = 0;
int _delay = 0;
void lv_qm_ui_loop(void)
{

    sprintf(ph_buf,"%0.2f", pH_value);
    lv_label_set_text(label_pH, ph_buf);
    if(point)
    {
        calib_pH(point);
        point =0;
    }









#ifdef BLOCKLY_loop
    blockly_loop();
#endif
}

void lv_qm_ui_entry(void)
{

    /*
    * create screens
    */
    main_screen = lv_obj_create(NULL, NULL);
    config_screen = lv_obj_create(NULL, NULL);
    login_screen = lv_obj_create(NULL, NULL);
    calib_screen = lv_obj_create(NULL, NULL);
    //CREATE STATIC OBJ
    lv_8ms_label_pH_create();
    lv_8ms_setting_button_create();
    lv_8ms_water_dis_create();
    lv_8ms_label_flow_water_create();
    lv_8ms_pH_dis_create();
    lv_8ms_bar_hydrogen_create();
    lv_8ms_text_setting_create();
    lv_8ms_text_hydro_create();
    lv_8ms_home_button_create();
    lv_8ms_calib_button_create();
    lv_8ms_wifi_button_create();
    lv_8ms_dropdown_select_filter_create();
    lv_8ms_clear_button_create();
    lv_8ms_edit_button_create();
    lv_8ms_text_info_filter_water_create();
    lv_8ms_image_background_login_create();
    lv_8ms_seeding_display_create();
    lv_8ms_return_home_create();
    lv_8ms_unlock_setting_create();
    lv_8ms_status_password_create();
    lv_8ms_start_calib_b_create();
    lv_8ms_start_calib_a_create();
    lv_8ms_start_calib_c_create();
    lv_8ms_pH_pos_a_create();
    lv_8ms_pH_pos_b_create();
    lv_8ms_pH_pos_c_create();
    lv_8ms_calib_to_home_create();

    static lv_style_t style_main_main_screen;
    lv_style_init(&style_main_main_screen);
    lv_style_set_bg_color(&style_main_main_screen, LV_STATE_DEFAULT, LV_COLOR_MAKE(0x00, 0x00, 0x00));
    //lv_style_set_border_color(&style_main_main_screen,LV_STATE_DEFAULT,LV_COLOR_MAKE(0x00, 0x00, 0x00));
    lv_obj_add_style(main_screen, LV_CONT_PART_MAIN, &style_main_main_screen);
    static lv_style_t style_main_config_screen;
    lv_style_init(&style_main_config_screen);
    lv_style_set_bg_color(&style_main_config_screen, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xda, 0xda, 0xda));
    //lv_style_set_border_color(&style_main_config_screen,LV_STATE_DEFAULT,LV_COLOR_MAKE(0xda, 0xda, 0xda));
    lv_obj_add_style(config_screen, LV_CONT_PART_MAIN, &style_main_config_screen);
    static lv_style_t style_main_calib_screen;
    lv_style_init(&style_main_calib_screen);
    lv_style_set_bg_color(&style_main_calib_screen, LV_STATE_DEFAULT, LV_COLOR_MAKE(0xf1, 0xf1, 0xf1));
    //lv_style_set_border_color(&style_main_calib_screen,LV_STATE_DEFAULT,LV_COLOR_MAKE(0xf1, 0xf1, 0xf1));
    lv_obj_add_style(calib_screen, LV_CONT_PART_MAIN, &style_main_calib_screen);
    lv_scr_load(main_screen);
    init_function();
}
/**
* @brief blockly initialization
*/

void lvgl_blockly_init()
{
#ifdef WT_WIFI
    blockly_wifi_init();
#endif // DEBUG
#ifdef WT_BLUFI
    blockly_blufi_init();
#endif // DEBUG
#ifdef WT_HTTP_REQUEST
    blockly_http_init();
#endif // WT_HTTP_REQUEST
}

/**
* @brief blockly loop
*/

void lvgl_blockly_loop()
{
#ifdef WT_BLUFI
    blockly_blufi_loop();
#endif // DEBUG
#ifdef WT_WIFI
    blockly_wifi_loop();
#endif // DEBUG
#ifdef WT_HTTP_REQUEST
    blockly_http_loop();
#endif // WT_HTTP_REQUEST
}

void lvgl_device_init(void)
{
#ifdef ESP32_GPIO
    lv_8ms_gpio_setup();
#endif
#ifdef ESP32_TIMER
    lv_8ms_timer_setup();
#endif
#ifdef ESP32_UART
    lv_8ms_uart_setup();
#endif
}

void lvgl_device_loop(void)
{
#ifdef ESP32_GPIO
    lv_8ms_gpio_loop();
#endif
#ifdef ESP32_TIMER
    lv_8ms_timer_loop();
#endif
#ifdef ESP32_UART
    lv_8ms_uart_loop();
#endif
}
lv_obj_t *lv_8ms_get_screen(char *name)
{
    int i = 0;
    for (i = 0; i < (sizeof(g_screens) / sizeof(g_screens[0])); i++)
    {
        if (!strcmp(name, g_screens[i].name))
        {
            return *(g_screens[i].id);
        }
    }
    return NULL;
}

lv_obj_t *lv_8ms_get_widget(char *w_name)
{
    int i = 0, j = 0;

    for (i = 0; i < (sizeof(g_screens) / sizeof(g_screens[0])); i++)
    {
        for (j = 0; j <  g_screens[i].len; j++)
        {
            if (!strcmp(w_name, g_screens[i].wids[j].name))
            {
                return *(g_screens[i].wids[j].id);
            }
        }
    }

    return NULL;
}

const char *lv_8ms_get_obj_name(lv_obj_t *obj)
{
    if (!obj)
    {
        return NULL;
    }

    int i = 0, j = 0;
    for (i = 0; i < (sizeof(g_screens) / sizeof(g_screens[0])); i++)
    {
        if (*(g_screens[i].id) == obj)
        {
            return g_screens[i].name;
        }

        for (j = 0; j <  g_screens[i].len; j++)
        {
            if (*(g_screens[i].wids[j].id) == obj)
            {
                return g_screens[i].wids[j].name;
            }
        }
    }

    return NULL;
}